openEsb/pr/OrquestadorCA/src/jbiasa/OrquestadorCA.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="OrquestadorCA"
             xmlns:tns="OrquestadorCA" xmlns:ns="http://j2ee.netbeans.org/wsdl/Orquestador/src/pilotoWSDL" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://tempuri.org/">
    <import namespace="http://j2ee.netbeans.org/wsdl/Orquestador/src/pilotoWSDL" location="../jbiServiceUnits/Orquestador/pilotoWSDL.wsdl"/>
    <import namespace="http://tempuri.org/" location="../jbiServiceUnits/Orquestador/localhost_44387/WebService1.asmx.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding2" type="ns:pilotoWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="pilotoWSDLOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="OrquestadorCA"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="OrquestadorCA"/>
            </output>
        </operation>
    </binding>
    <binding name="casaBinding1" type="ns1:WebService1Soap">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="HelloWorld">
            <soap:operation/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
        <operation name="AgregarPiloto">
            <soap:operation/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
        <operation name="FinalizarViaje">
            <soap:operation/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="OrquestadorCAService1">
        <port name="result_pilotos" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/OrquestadorCAService1/result_pilotos"/>
        </port>
    </service>
    <service name="OrquestadorCAService2">
        <port name="entrada_pilotos" binding="tns:casaBinding2">
            <soap:address location="http://localhost:${HttpDefaultPort}/OrquestadorCAService2/entrada_pilotos"/>
        </port>
    </service>
</definitions>
